IsModifiable Property
 Identifies if the element is modifiable.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  Since:  2023
 Syntax
  C#
public bool IsModifiable { get; }
  Visual Basic
Public ReadOnly Property IsModifiable As Boolean
	Get
  Visual C++
public:
property bool IsModifiable {
	bool get ();
}
 Remarks
 This is not a permanent state. The value depends on the document state. For example, active edit modes can make IsModifiable false for many elements.
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →